[
    {
        "key": "apex",
        "name": "Apex",
        "role": "Super Naturals — frontline legend",
        "blurb": "Charismatic, dangerous, loyal. Eats like a king, fights like a storm, laughs like it won’t last.",
        "affinity": {
            "smith": 4,
            "leatherworker": 3,
            "relicator": 2,
            "alchemist": 3,
            "architect": 2,
            "historian": 2,
            "cartographer": 2,
            "quartermaster": 3,
            "infobroker": 2,
            "bard": 4
        },
        "tiers": [
            {
                "tier": 1,
                "title": "Road Banter",
                "unlock": 1,
                "notes": "Food, jokes, minor rivalry that keeps the nerves from showing."
            },
            {
                "tier": 2,
                "title": "Old Scars",
                "unlock": 3,
                "notes": "Why he joined the league; fear of being replaced by the next legend."
            },
            {
                "tier": 3,
                "title": "The Unspoken Contract",
                "unlock": 6,
                "notes": "Hints at giantkin politics and the string-pullers who set the fights."
            }
        ],
        "nodes": [
            {
                "key": "apex_intro",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Apex flips a coin across his knuckles and asks how you keep your hands steady before a fight.",
                "text_variants": {
                    "smith": "Apex flips a coin across his knuckles and asks how you keep your hands steady before a fight. He notices your calluses like a badge.",
                    "bard": "Apex flips a coin across his knuckles and asks how you keep your hands steady before a fight. He wants a line worth repeating.",
                    "quartermaster": "Apex flips a coin across his knuckles and asks how you keep your hands steady before a fight. He pretends it’s banter, but he’s taking your measure."
                }
            },
            {
                "key": "apex_scars",
                "tierMin": 2,
                "actMin": 1,
                "kind": "Bond",
                "text": "He rolls back a sleeve, showing old league scars, and asks what you would trade for victory.",
                "text_variants": {
                    "leatherworker": "He rolls back a sleeve, showing old league scars, and asks what you would trade for victory. He tests if you know the price of skin.",
                    "historian": "He rolls back a sleeve, showing old league scars, and asks what you would trade for victory. He wants to know how you record the cost.",
                    "bard": "He rolls back a sleeve, showing old league scars, and asks what you would trade for victory. He wants the answer he can live with."
                }
            },
            {
                "key": "apex_contract",
                "tierMin": 4,
                "actMin": 2,
                "kind": "Bond",
                "text": "He admits the league made him sign an oath he regrets — and hints at who holds the pen.",
                "text_variants": {
                    "infobroker": "He admits the league made him sign an oath he regrets — and hints at who holds the pen. He wants to know if you recognize the signature.",
                    "quartermaster": "He admits the league made him sign an oath he regrets — and hints at who holds the pen. He watches how you count the debt.",
                    "historian": "He admits the league made him sign an oath he regrets — and hints at who holds the pen. He asks if you would write that name down."
                }
            },
            {
                "key": "blessing_echo",
                "tierMin": 1,
                "actMin": 1,
                "requiresFlags": [
                    "blessing_received"
                ],
                "kind": "Blessing Echo",
                "text": "He repeats the shaman’s blessing with surprising care.",
                "text_variants": {
                    "bard": "He repeats the shaman’s blessing with surprising care, as if guarding the rhythm.",
                    "smith": "He repeats the shaman’s blessing with surprising care, the way you repeat a dangerous process.",
                    "relicator": "He repeats the shaman’s blessing with surprising care, and you hear a hidden cadence."
                }
            }
        ]
    },
    {
        "key": "dedor",
        "name": "Dedor",
        "role": "Super Naturals — strategist / moral compass",
        "blurb": "Measured voice, sharp eyes. Notices what everyone else avoids and refuses to let it slide.",
        "affinity": {
            "smith": 3,
            "leatherworker": 3,
            "relicator": 3,
            "alchemist": 2,
            "architect": 4,
            "historian": 4,
            "cartographer": 3,
            "quartermaster": 3,
            "infobroker": 2,
            "bard": 2
        },
        "tiers": [
            {
                "tier": 1,
                "title": "Campfire Ethics",
                "unlock": 1,
                "notes": "He asks what you believe in, and how far it stretches."
            },
            {
                "tier": 2,
                "title": "The Map of Consequence",
                "unlock": 3,
                "notes": "Reframes choices as debts, not wins."
            },
            {
                "tier": 3,
                "title": "A Secret He Won’t Write Down",
                "unlock": 6,
                "notes": "Knows something about the chest, and about who sent it."
            }
        ],
        "nodes": [
            {
                "key": "dedor_intro",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Dedor asks what you would burn to keep the pilgrims safe.",
                "text_variants": {
                    "architect": "Dedor asks what you would burn to keep the pilgrims safe. He waits to see if you can name a structure.",
                    "historian": "Dedor asks what you would burn to keep the pilgrims safe. He waits to see if you can name a story.",
                    "quartermaster": "Dedor asks what you would burn to keep the pilgrims safe. He expects you to say supplies."
                }
            },
            {
                "key": "dedor_debt",
                "tierMin": 2,
                "actMin": 1,
                "kind": "Bond",
                "text": "He sketches a map of debts in the dust, naming the league as the biggest creditor.",
                "text_variants": {
                    "historian": "He sketches a map of debts in the dust, naming the league as the biggest creditor. He asks who keeps the ledger.",
                    "infobroker": "He sketches a map of debts in the dust, naming the league as the biggest creditor. He wants to know which link you would cut.",
                    "cartographer": "He sketches a map of debts in the dust, naming the league as the biggest creditor. It looks uncomfortably like your routes."
                }
            },
            {
                "key": "dedor_secret",
                "tierMin": 4,
                "actMin": 2,
                "kind": "Bond",
                "text": "He confesses he once worked for the league — just long enough to learn their blind spot.",
                "text_variants": {
                    "infobroker": "He confesses he once worked for the league — just long enough to learn their blind spot. He asks if you know yours.",
                    "historian": "He confesses he once worked for the league — just long enough to learn their blind spot. He asks if you will write it down.",
                    "architect": "He confesses he once worked for the league — just long enough to learn their blind spot. He tells you where the wall is weak."
                }
            },
            {
                "key": "blessing_echo",
                "tierMin": 1,
                "actMin": 1,
                "requiresFlags": [
                    "blessing_received"
                ],
                "kind": "Blessing Echo",
                "text": "He quietly recites the blessing like a vow.",
                "text_variants": {
                    "historian": "He quietly recites the blessing like a vow, the way treaties are sealed.",
                    "relicator": "He quietly recites the blessing like a vow, and you feel the ritual tighten.",
                    "quartermaster": "He quietly recites the blessing like a vow, and you feel the weight of the promise."
                }
            }
        ]
    },
    {
        "key": "theramous",
        "name": "Theramous",
        "role": "Super Naturals — specialist / steady hand",
        "blurb": "A calm presence with a habit of being right at the worst possible time.",
        "affinity": {
            "smith": 2,
            "leatherworker": 3,
            "relicator": 3,
            "alchemist": 2,
            "architect": 3,
            "historian": 3,
            "cartographer": 2,
            "quartermaster": 3,
            "infobroker": 2,
            "bard": 1
        },
        "tiers": [
            {
                "tier": 1,
                "title": "Tradecraft Talk",
                "unlock": 1,
                "notes": "He asks about your craft and listens like it matters."
            },
            {
                "tier": 2,
                "title": "The League’s Math",
                "unlock": 3,
                "notes": "Explains why the league always seems to be ahead of the rumor mill."
            },
            {
                "tier": 3,
                "title": "A Promise in Ink",
                "unlock": 6,
                "notes": "You learn what he is trying to protect by staying in the party."
            }
        ],
        "nodes": [
            {
                "key": "theramous_intro",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Theramous asks about your craft and promises to keep the ledgers straight.",
                "text_variants": {
                    "quartermaster": "Theramous asks about your craft and promises to keep the ledgers straight. He means it.",
                    "alchemist": "Theramous asks about your craft and promises to keep the ledgers straight. He wants to know which mixtures you won’t name.",
                    "architect": "Theramous asks about your craft and promises to keep the ledgers straight. He listens for how you measure risk."
                }
            },
            {
                "key": "theramous_math",
                "tierMin": 2,
                "actMin": 1,
                "kind": "Bond",
                "text": "He breaks down the league’s logistics and how to slip between them.",
                "text_variants": {
                    "cartographer": "He breaks down the league’s logistics and how to slip between them. He asks you to redraw your map.",
                    "infobroker": "He breaks down the league’s logistics and how to slip between them. He wants to know which contact you would burn.",
                    "quartermaster": "He breaks down the league’s logistics and how to slip between them. He looks at you like you already knew."
                }
            },
            {
                "key": "theramous_promise",
                "tierMin": 4,
                "actMin": 2,
                "kind": "Bond",
                "text": "He shows you a promise written in invisible ink — and trusts you with it.",
                "text_variants": {
                    "relicator": "He shows you a promise written in invisible ink — and trusts you with it. You feel the magic where it shouldn’t be.",
                    "historian": "He shows you a promise written in invisible ink — and trusts you with it. He asks if you will keep it unrecorded.",
                    "quartermaster": "He shows you a promise written in invisible ink — and trusts you with it. You hear a debt that can’t be repaid."
                }
            }
        ]
    },
    {
        "key": "widjet",
        "name": "Widjet",
        "role": "Super Naturals — tinkerer / comic relief",
        "blurb": "A pocketful of springs and wisdom disguised as nonsense.",
        "affinity": {
            "smith": 4,
            "leatherworker": 2,
            "relicator": 3,
            "alchemist": 3,
            "architect": 3,
            "historian": 2,
            "cartographer": 2,
            "quartermaster": 3,
            "infobroker": 2,
            "bard": 3
        },
        "tiers": [
            {
                "tier": 1,
                "title": "Gadget Nights",
                "unlock": 1,
                "notes": "Shows you a strange hinge-mechanism."
            },
            {
                "tier": 2,
                "title": "Laughing at Giants",
                "unlock": 3,
                "notes": "Explains giant sports rituals with unsettling accuracy."
            },
            {
                "tier": 3,
                "title": "Hidden Compartment",
                "unlock": 6,
                "notes": "He saw something inside the chest when no one was watching."
            }
        ],
        "nodes": [
            {
                "key": "widjet_intro",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Widjet produces a hinge made of three metals and asks which one you would keep.",
                "text_variants": {
                    "smith": "Widjet produces a hinge made of three metals and asks which one you would keep. He expects you to name the flaw.",
                    "relicator": "Widjet produces a hinge made of three metals and asks which one you would keep. You hear a trick in the metal.",
                    "bard": "Widjet produces a hinge made of three metals and asks which one you would keep. He wants the answer that makes him laugh."
                }
            },
            {
                "key": "widjet_giants",
                "tierMin": 2,
                "actMin": 1,
                "kind": "Bond",
                "text": "He explains a giant sports ritual with unsettling accuracy.",
                "text_variants": {
                    "historian": "He explains a giant sports ritual with unsettling accuracy. He’s unusually careful with the names.",
                    "cartographer": "He explains a giant sports ritual with unsettling accuracy. He draws the field like a map.",
                    "bard": "He explains a giant sports ritual with unsettling accuracy. He mimics the chants under his breath."
                }
            },
            {
                "key": "widjet_compartment",
                "tierMin": 4,
                "actMin": 2,
                "kind": "Bond",
                "text": "He admits he saw something inside the chest when no one was watching.",
                "text_variants": {
                    "relicator": "He admits he saw something inside the chest when no one was watching. He asks if you believe him.",
                    "infobroker": "He admits he saw something inside the chest when no one was watching. He waits to see if you buy the story.",
                    "smith": "He admits he saw something inside the chest when no one was watching. He swears it wasn’t a hinge."
                }
            }
        ]
    },
    {
        "key": "jeffery",
        "name": "Jeffery",
        "role": "Pilgrim — the only one who can open the chest",
        "blurb": "No league ties. Quiet, competent. The key is not metal.",
        "affinity": {
            "smith": 2,
            "leatherworker": 2,
            "relicator": 4,
            "alchemist": 3,
            "architect": 3,
            "historian": 3,
            "cartographer": 2,
            "quartermaster": 2,
            "infobroker": 3,
            "bard": 1
        },
        "tiers": [
            {
                "tier": 1,
                "title": "Hands of Ceremony",
                "unlock": 1,
                "notes": "Hints at opening as a rite, not a trick."
            },
            {
                "tier": 2,
                "title": "The Chest’s True Lock",
                "unlock": 3,
                "notes": "A vow. A name. A sacrifice? (kept non-graphic)."
            },
            {
                "tier": 3,
                "title": "Who Sent You?",
                "unlock": 6,
                "notes": "He tests whether you’re league-clean or league-tainted."
            }
        ],
        "nodes": [
            {
                "key": "jeffery_intro",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Jeffery says the chest doesn’t open with force; it opens with permission.",
                "text_variants": {
                    "relicator": "Jeffery says the chest doesn’t open with force; it opens with permission. You feel the ritual in the word.",
                    "smith": "Jeffery says the chest doesn’t open with force; it opens with permission. You set your tools down anyway.",
                    "historian": "Jeffery says the chest doesn’t open with force; it opens with permission. You wonder who grants it."
                }
            },
            {
                "key": "jeffery_lock",
                "tierMin": 2,
                "actMin": 1,
                "kind": "Bond",
                "text": "He hints the true lock is a vow, not a key.",
                "text_variants": {
                    "bard": "He hints the true lock is a vow, not a key. He asks what you would sing to seal it.",
                    "infobroker": "He hints the true lock is a vow, not a key. He asks who you would bind.",
                    "alchemist": "He hints the true lock is a vow, not a key. You wonder what it reacts to."
                }
            },
            {
                "key": "jeffery_test",
                "tierMin": 4,
                "actMin": 2,
                "kind": "Bond",
                "text": "He asks who you’d let touch the chest if you never returned.",
                "text_variants": {
                    "quartermaster": "He asks who you’d let touch the chest if you never returned. You think about who can keep a secret.",
                    "historian": "He asks who you’d let touch the chest if you never returned. You think about who would tell the truth.",
                    "relicator": "He asks who you’d let touch the chest if you never returned. You think about who can bear the magic."
                }
            }
        ]
    },
    {
        "key": "pilgrim_1",
        "name": "Iria",
        "role": "Pilgrim — stone-singer",
        "blurb": "Hums when nervous. Knows the old giant words and when not to use them.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Old Hymns",
                "unlock": 1,
                "notes": "She teaches you a phrase that means safe passage."
            }
        ],
        "nodes": [
            {
                "key": "iria_hymn",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Iria teaches a quiet phrase meaning safe passage, then asks you not to waste it.",
                "text_variants": {
                    "historian": "Iria teaches a quiet phrase meaning safe passage, then asks you not to waste it. She wants it remembered the right way.",
                    "bard": "Iria teaches a quiet phrase meaning safe passage, then asks you not to waste it. She refuses to sing it."
                }
            }
        ]
    },
    {
        "key": "pilgrim_2",
        "name": "Rook",
        "role": "Pilgrim — pack-master",
        "blurb": "Can calm beasts with a look. Keeps the offering secure and resents sloppy knots.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Load & Balance",
                "unlock": 1,
                "notes": "He shows you how to shift weight so the cart doesn’t betray you."
            }
        ],
        "nodes": [
            {
                "key": "rook_balance",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Rook shows how to shift weight so the cart never squeals, then asks if you trust him with the chest.",
                "text_variants": {
                    "quartermaster": "Rook shows how to shift weight so the cart never squeals, then asks if you trust him with the chest. You hear the question behind the question.",
                    "leatherworker": "Rook shows how to shift weight so the cart never squeals, then asks if you trust him with the chest. He checks your straps without asking."
                }
            }
        ]
    },
    {
        "key": "pilgrim_3",
        "name": "Sable",
        "role": "Pilgrim — quiet watcher",
        "blurb": "Speaks rarely; notices everything, refuses to say how.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Eyes on the League",
                "unlock": 1,
                "notes": "She points out the signs of being followed."
            }
        ],
        "nodes": [
            {
                "key": "sable_watch",
                "tierMin": 0,
                "actMin": 0,
                "kind": "Bond",
                "text": "Sable points out the signs of being followed, then goes quiet again as if she said too much.",
                "text_variants": {
                    "infobroker": "Sable points out the signs of being followed, then goes quiet again as if she said too much. You trade a glance of mutual caution.",
                    "cartographer": "Sable points out the signs of being followed, then goes quiet again as if she said too much. You note the marks on your map."
                }
            }
        ]
    },
    {
        "key": "guide_1",
        "name": "Brann",
        "role": "Hired Guide — spear & shield",
        "blurb": "Professional. Not cheap. Not sentimental, which is its own kind of honesty.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Hard Terms",
                "unlock": 1,
                "notes": "He explains what your coin actually buys."
            }
        ],
        "nodes": [
            {
                "key": "brann_terms",
                "tierMin": 0,
                "actMin": 2,
                "kind": "Guide Note",
                "text": "Brann explains what your coin buys — and what it doesn’t. He wants it said out loud.",
                "text_variants": {
                    "quartermaster": "Brann explains what your coin buys — and what it doesn’t. He approves of the clarity, not the price.",
                    "bard": "Brann explains what your coin buys — and what it doesn’t. He refuses to sugarcoat it."
                }
            }
        ]
    },
    {
        "key": "guide_2",
        "name": "Mira",
        "role": "Hired Guide — tracker",
        "blurb": "Smiles while counting exits. Knows the wind by its habits.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Tracks in Snow",
                "unlock": 1,
                "notes": "She teaches you to read wind like handwriting."
            }
        ],
        "nodes": [
            {
                "key": "mira_tracks",
                "tierMin": 0,
                "actMin": 2,
                "kind": "Guide Note",
                "text": "Mira teaches you to read wind like handwriting, and admits the league writes in a heavy hand.",
                "text_variants": {
                    "cartographer": "Mira teaches you to read wind like handwriting, and admits the league writes in a heavy hand. You adjust your lines.",
                    "infobroker": "Mira teaches you to read wind like handwriting, and admits the league writes in a heavy hand. You wonder who taught her."
                }
            }
        ]
    },
    {
        "key": "guide_3",
        "name": "Kest",
        "role": "Hired Guide — bow",
        "blurb": "Speaks in short sentences; hits in longer distances.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "No Heroics",
                "unlock": 1,
                "notes": "He warns you about league hunters."
            }
        ],
        "nodes": [
            {
                "key": "kest_warning",
                "tierMin": 0,
                "actMin": 2,
                "kind": "Guide Note",
                "text": "Kest warns you the league’s arrows don’t miss twice. He means the first shot is the warning.",
                "text_variants": {
                    "smith": "Kest warns you the league’s arrows don’t miss twice. He taps the fletching like a craftsman.",
                    "leatherworker": "Kest warns you the league’s arrows don’t miss twice. He eyes your armor and says nothing."
                }
            }
        ]
    },
    {
        "key": "master",
        "name": "Master Orlan",
        "role": "Village Master — healer-smith",
        "blurb": "A veteran craftsperson who treats wounds like flawed steel, and people like steel with flaws.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Lessons Paid in Sweat",
                "unlock": 1,
                "notes": "He offers to teach… if you earn it."
            }
        ],
        "nodes": [
            {
                "key": "master_intro",
                "tierMin": 0,
                "actMin": 2,
                "requiresFlags": [
                    "master_joined"
                ],
                "kind": "Master Lesson",
                "text": "Master Orlan critiques your hammer stance and offers a correction without softening the truth.",
                "text_variants": {
                    "smith": "Master Orlan critiques your hammer stance and offers a correction without softening the truth. He expects you to take it.",
                    "architect": "Master Orlan critiques your hammer stance and offers a correction without softening the truth. He watches how you adapt."
                }
            },
            {
                "key": "master_lesson",
                "tierMin": 2,
                "actMin": 2,
                "requiresFlags": [
                    "master_joined"
                ],
                "kind": "Master Lesson",
                "text": "He teaches a repair trick that saves supplies in a pinch, then asks what you would give up to keep the caravan whole.",
                "text_variants": {
                    "smith": "He nods at your build, then shares a forge trick only smiths should know. He asks what you’d sacrifice to keep the steel true.",
                    "quartermaster": "He teaches a repair trick that saves supplies in a pinch, then asks what you would give up to keep the caravan whole. He wants an honest answer."
                }
            }
        ]
    },
    {
        "key": "apprentice",
        "name": "Pip",
        "role": "Apprentice — bright-eyed",
        "blurb": "Wants to see giantland someday. Talks too fast and listens too hard.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Pocket Questions",
                "unlock": 1,
                "notes": "Asks you what giants are really like."
            }
        ],
        "nodes": [
            {
                "key": "pip_intro",
                "tierMin": 0,
                "actMin": 2,
                "requiresFlags": [
                    "apprentice_joined"
                ],
                "kind": "Apprentice",
                "text": "Pip peppers you with questions about giantland and the chest, then blurts that they want to make something that lasts.",
                "text_variants": {
                    "smith": "Pip peppers you with questions about giantland and the chest, then blurts that they want to make something that lasts. They watch your hands.",
                    "historian": "Pip peppers you with questions about giantland and the chest, then blurts that they want to make something that lasts. They ask how you remember things."
                }
            }
        ]
    },
    {
        "key": "mother_ref",
        "name": "Lysa",
        "role": "Refuge Mother",
        "blurb": "Practical kindness. Protects her children with her spine and her silence.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Shared Fire",
                "unlock": 1,
                "notes": "A small act of care changes the whole mood of camp."
            }
        ],
        "nodes": [
            {
                "key": "lysa_intro",
                "tierMin": 0,
                "actMin": 2,
                "requiresFlags": [
                    "refugees_joined"
                ],
                "kind": "Refugee",
                "text": "Lysa thanks you for taking her children in and offers to share rations she can’t really spare.",
                "text_variants": {
                    "quartermaster": "Lysa thanks you for taking her children in and offers to share rations she can’t really spare. You notice how little she kept.",
                    "bard": "Lysa thanks you for taking her children in and offers to share rations she can’t really spare. Her gratitude sounds like relief and fear together."
                }
            }
        ]
    },
    {
        "key": "child_1",
        "name": "Nell",
        "role": "Child — daughter",
        "blurb": "Curious, brave, and not impressed by adults.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Stories for Coins",
                "unlock": 1,
                "notes": "She trades local gossip for a bedtime tale."
            }
        ],
        "nodes": [
            {
                "key": "nell_story",
                "tierMin": 0,
                "actMin": 2,
                "requiresFlags": [
                    "refugees_joined"
                ],
                "kind": "Child",
                "text": "Nell trades gossip for a bedtime story, then corrects your ending.",
                "text_variants": {
                    "bard": "Nell trades gossip for a bedtime story, then corrects your ending. She wants the part where someone listens.",
                    "historian": "Nell trades gossip for a bedtime story, then corrects your ending. She remembers the details adults miss."
                }
            }
        ]
    },
    {
        "key": "child_2",
        "name": "Hob",
        "role": "Child — son",
        "blurb": "Quiet until he laughs. Then you remember why you keep walking.",
        "affinity": {},
        "tiers": [
            {
                "tier": 1,
                "title": "Lucky Charm",
                "unlock": 1,
                "notes": "He gives you a trinket for the bad nights."
            }
        ],
        "nodes": [
            {
                "key": "hob_charm",
                "tierMin": 0,
                "actMin": 2,
                "requiresFlags": [
                    "refugees_joined"
                ],
                "kind": "Child",
                "text": "Hob gives you a lucky trinket for the rough nights and asks if you’re scared, too.",
                "text_variants": {
                    "leatherworker": "Hob gives you a lucky trinket for the rough nights and asks if you’re scared, too. You tie it to your gear.",
                    "relicator": "Hob gives you a lucky trinket for the rough nights and asks if you’re scared, too. You feel a faint hum."
                }
            }
        ]
    }
]
